emme-tho/STM32H745/CM7/Core/Src/i2c_mode.c
#include "i2c_mode.h"
#include "cli.h"
#include "pmic.h"
#include "usbd_cdc_if.h"   // CDC_Transmit_HS
#include "setup_utils.h"

#include "stm32h7xx_hal.h"
#include <string.h>
#include <stdlib.h>

extern I2C_HandleTypeDef hi2c1;   // I2C1 am Controller

// ============================================================
// I2C MODE (Tool-Port)
//
// Stream-Write (Option A, aktuell):
//   w(ADDR7)(DATA...)(zDATA...)*p
//
// - ADDR7: erstes Byte nach 'w' (2 Hex-Zeichen -> 1 Byte)
//          NUR 7-bit erlaubt: 0x00..0x7F
//          Beispiel: w50AABBp  -> addr=0x50, data=AA BB
//
// - z: Segmentmarker ("no-stop" für später). Aktuell: nur Echo/Trennung.
// - p: finalisieren + alles in EINEM I2C-Transmit senden (Stop am Ende)
//
// - Odd nibble: falls ein Nibble fehlt, wird automatisch '0' vorne eingefuegt
// - 's' (nur im I2C Mode): i2cdetect-style Scan
// - 'x' soll global wirken: Write-Capture wird abgebrochen, 'x' wird NICHT konsumiert
// ============================================================

#define I2C_TX_TIMEOUT_MS     (100u)

/*
 * Runtime-configurable I2C settings for the Tool-Port.
 * NOTE: The I2C speed is set via the TIMING register (hi2c1.Init.Timing).
 * To make 10/100/400kHz work reliably, copy the TIMING values from CubeMX
 * (I2C1 -> Parameter Settings) into these macros (or pass them as compiler defines).
 * If a timing macro is left as 0, the code falls back to the current TIMING value
 * (menu works, but speed does not change).
 */
#ifndef I2C1_TIMING_10KHZ
#define I2C1_TIMING_10KHZ  		0x200009FE
#endif
#ifndef I2C1_TIMING_100KHZ
#define I2C1_TIMING_100KHZ  	0x20000215
#endif
#ifndef I2C1_TIMING_400KHZ
#define I2C1_TIMING_400KHZ  	0x0000020B
#endif


// ---------------- Write stream state ----------------
static uint8_t  ws_active     = 0;
static uint8_t  ws_have_addr  = 0;
static uint8_t  ws_addr7      = 0;

static char     ws_nibbles[2u * 256u + 4u];
static uint16_t ws_nib_len    = 0;

static uint8_t  ws_tx[256];
static uint16_t ws_tx_len     = 0;

static uint32_t ws_seg_idx    = 0;

// ---------------- Read extension ----------------
// After 'r' inside a write-stream, we switch into read-mode.
// Supported forms:
//   w<addr7><reg8>r<LEN_HEX>p   (e.g. w3c57r01p)
//   w<addr7><reg8>rbp          (1 byte)
//   w<addr7><reg8>rwp          (2 bytes)
//   w<addr7><reg8>rhp          (4 bytes)
static uint8_t  rs_active     = 0;
static char     rs_nibbles[4];
static uint8_t  rs_nib_len    = 0;
static uint8_t  rs_len_set    = 0;
static uint16_t rs_len        = 0;
static uint8_t  ws_rx[256];

static const char* voltage_i2c = "ldo1";

// ---------------- Setup menu state ----------------
typedef enum {
    I2C_SETUP_NONE = 0,
    I2C_SETUP_MAIN,
    I2C_SETUP_VOLTAGE,
    I2C_SETUP_CLOCK,
} i2c_setup_state_t;

static i2c_setup_state_t g_setup_state = I2C_SETUP_NONE;

// Current settings (cached for display)
static uint16_t g_ldo1_mv   = 0;   // 0 = unknown
static uint8_t  g_ldo1_en   = 0;
static uint32_t g_i2c_khz   = 0;   // 0 = unknown

// Timing presets (loaded lazily)
static uint8_t  g_timings_inited = 0;
static uint32_t g_timing_10k  = 0;
static uint32_t g_timing_100k = 0;
static uint32_t g_timing_400k = 0;


// ---------------- Helpers ----------------
static int hex_nibble(char c)
{
    if (c >= '0' && c <= '9') return (c - '0');
    if (c >= 'a' && c <= 'f') return (c - 'a' + 10);
    if (c >= 'A' && c <= 'F') return (c - 'A' + 10);
    return -1;
}

static void ws_reset(void)
{
    ws_active = 0;
    ws_have_addr = 0;
    ws_addr7 = 0;
    ws_nib_len = 0;
    ws_tx_len = 0;
    ws_seg_idx = 0;

    memset(ws_nibbles, 0, sizeof(ws_nibbles));
}

static void print_bytes(const uint8_t *b, uint16_t n)
{
    for (uint16_t i = 0; i < n; i++) {
        cli_printf("%02X", b[i]);
        if (i + 1u < n) cli_printf(" ");
    }
}

static void i2c_dump_print_line(uint8_t offset, const uint8_t *data, uint8_t ok)
{
    cli_printf("%02X: ", offset);
    for (uint8_t i = 0; i < 16u; i++) {
        if (ok) cli_printf("%02X ", data[i]);
        else cli_printf("?? ");
    }
    cli_printf("|");
    for (uint8_t i = 0; i < 16u; i++) {
        char ch = '.';
        if (ok) {
            uint8_t v = data[i];
            if (v >= 0x20u && v <= 0x7Eu) {
                ch = (char)v;
            }
        }
        cli_printf("%c", ch);
    }
    cli_printf("|\r\n");
}

static void i2c_dump_device(uint8_t addr7)
{
    uint8_t row[16];

    cli_printf("\r\nI2C dump addr7=0x%02X (bus=0x%02X)\r\n", addr7, (uint8_t)(addr7 << 1));
    cli_printf("     00 01 02 03 04 05 06 07 08 09 0A 0B 0C 0D 0E 0F  |ASCII|\r\n");

    for (uint16_t offset = 0; offset < 0x100u; offset += 16u) {
        if (HAL_I2C_GetState(&hi2c1) != HAL_I2C_STATE_READY) {
            (void)HAL_I2C_DeInit(&hi2c1);
            (void)HAL_I2C_Init(&hi2c1);
        }

        HAL_StatusTypeDef st = HAL_I2C_Mem_Read(
                &hi2c1,
                (uint16_t)(addr7 << 1),
                offset,
                I2C_MEMADD_SIZE_8BIT,
                row,
                (uint16_t)sizeof(row),
                I2C_TX_TIMEOUT_MS
        );

        i2c_dump_print_line((uint8_t)offset, row, (st == HAL_OK));

        // ErrorCode löschen, damit der nächste Versuch sauber ist
        hi2c1.ErrorCode = HAL_I2C_ERROR_NONE;
    }

    cli_printf("\r\n");
}



// Finalisiert aktuelle Segment-Nibbles -> Bytes
// - odd nibble: fuehrende 0
// - erstes Byte (wenn noch keine Adresse): wird Adresse (7-bit enforced)
// - restliche Bytes werden appended in ws_tx[]
static HAL_StatusTypeDef ws_finalize_segment_and_append(uint16_t *out_new_start, uint16_t *out_new_len)
{
    if (out_new_start) *out_new_start = ws_tx_len;
    if (out_new_len)   *out_new_len   = 0;

    if (ws_nib_len == 0) return HAL_OK;

    char tmp[sizeof(ws_nibbles)];
    uint16_t tlen = ws_nib_len;

    if (tlen & 1u) {
        if ((tlen + 1u) > sizeof(tmp)) return HAL_ERROR;
        tmp[0] = '0';
        memcpy(&tmp[1], ws_nibbles, tlen);
        tlen++;
    } else {
        memcpy(tmp, ws_nibbles, tlen);
    }

    uint16_t new_start = ws_tx_len;
    uint16_t new_bytes = 0;

    for (uint16_t i = 0; i < tlen; i += 2u) {
        int a = hex_nibble(tmp[i]);
        int b = hex_nibble(tmp[i + 1u]);
        if (a < 0 || b < 0) return HAL_ERROR;

        uint8_t byte = (uint8_t)((a << 4) | b);

        if (!ws_have_addr) {
            // NUR 7-bit Adresse erlauben
            if (byte > 0x7Fu) {
                return HAL_ERROR;
            }
            ws_addr7 = byte;
            ws_have_addr = 1;
        } else {
            if (ws_tx_len >= sizeof(ws_tx)) return HAL_ERROR;
            ws_tx[ws_tx_len++] = byte;
            new_bytes++;
        }
    }

    ws_nib_len = 0;

    if (out_new_start) *out_new_start = new_start;
    if (out_new_len)   *out_new_len   = new_bytes;
    return HAL_OK;
}

// ---------------- Setup helpers ----------------
static void i2c_init_timings_if_needed(void)
{
    if (g_timings_inited) return;

    // If macros are 0, fall back to current timing (no speed change).
    uint32_t cur = hi2c1.Init.Timing;

    g_timing_10k  = (I2C1_TIMING_10KHZ  != 0u) ? I2C1_TIMING_10KHZ  : cur;
    g_timing_100k = (I2C1_TIMING_100KHZ != 0u) ? I2C1_TIMING_100KHZ : cur;
    g_timing_400k = (I2C1_TIMING_400KHZ != 0u) ? I2C1_TIMING_400KHZ : cur;

    if (g_i2c_khz == 0u) {
        g_i2c_khz = 100u; // best-effort default
    }

    g_timings_inited = 1;
}

// ---------------- Read helpers ----------------
static HAL_StatusTypeDef rs_parse_len(uint16_t *out_len)
{
    if (!out_len) return HAL_ERROR;

    if (rs_len_set) {
        *out_len = rs_len;
        return HAL_OK;
    }

    if (rs_nib_len == 0) {
        return HAL_ERROR;
    }

    // parse up to 4 hex nibbles as integer (e.g. '1' -> 0x1, '01' -> 0x1, '0010' -> 0x10)
    uint16_t val = 0;
    for (uint8_t i = 0; i < rs_nib_len; i++) {
        int n = hex_nibble(rs_nibbles[i]);
        if (n < 0) return HAL_ERROR;
        val = (uint16_t)((val << 4) | (uint16_t)n);
    }

    *out_len = val;
    return HAL_OK;
}


static void i2c_print_setting_summary(void)
{
    cli_printf("  Voltage (LDO1): ");
    if (g_ldo1_mv == 0u) cli_printf("unknown");
    else cli_printf("%umV", g_ldo1_mv);
    cli_printf("  EN=%u\r\n", (unsigned)g_ldo1_en);

    cli_printf("  I2C clk: ");
    if (g_i2c_khz == 0u) cli_printf("unknown");
    else cli_printf("%lu kHz", (unsigned long)g_i2c_khz);
    cli_printf("\r\n");
}

