emme-tho/STM32H745/CM7/Core/Src/i2c_mode.c
static void i2c_setup_show_main(void)
{
    g_setup_state = I2C_SETUP_MAIN;
    i2c_init_timings_if_needed();

    cli_printf("\r\n[I2C Setup]\r\n");
    i2c_print_setting_summary();
    cli_printf("\r\n");
    cli_printf("  1 - Voltage\r\n");
    cli_printf("  2 - Clock\r\n");
    cli_printf("  q - back to I2C\r\n");
    cli_printf("\r\nAuswahl: ");
}

static void i2c_setup_show_voltage(void)
{
    g_setup_state = I2C_SETUP_VOLTAGE;

    cli_printf("\r\n[I2C Setup] Voltage (LDO1)\r\n");
    cli_printf("Aktuell: ");
    if (g_ldo1_mv == 0u) cli_printf("unknown");
    else cli_printf("%umV", g_ldo1_mv);
    cli_printf("  EN=%u\r\n\r\n", (unsigned)g_ldo1_en);

    cli_printf("  1 - 800 mV\r\n");
    cli_printf("  2 - 1800 mV\r\n");
    cli_printf("  3 - 3300 mV\r\n");
    cli_printf("  q - back\r\n");
    cli_printf("\r\nAuswahl: ");
}

static void i2c_setup_show_clock(void)
{
    g_setup_state = I2C_SETUP_CLOCK;
    i2c_init_timings_if_needed();

    cli_printf("\r\n[I2C Setup] Clock\r\n");
    cli_printf("Aktuell: ");
    if (g_i2c_khz == 0u) cli_printf("unknown");
    else cli_printf("%lu kHz", (unsigned long)g_i2c_khz);
    cli_printf("\r\n\r\n");

    cli_printf("  1 - 10 kHz\r\n");
    cli_printf("  2 - 100 kHz\r\n");
    cli_printf("  3 - 400 kHz\r\n");
    cli_printf("  q - back\r\n");
    cli_printf("\r\nAuswahl: ");
}



static void i2c_reinit_with_timing(uint32_t timing, uint32_t khz)
{
    (void)HAL_I2C_DeInit(&hi2c1);
    hi2c1.Init.Timing = timing;
    HAL_StatusTypeDef st = HAL_I2C_Init(&hi2c1);

    if (st == HAL_OK) {
        g_i2c_khz = khz;
        cli_printf("\r\nI2C clk set to %lu kHz\r\n", (unsigned long)khz);

        if ((khz == 10u  && I2C1_TIMING_10KHZ  == 0u) ||
            (khz == 100u && I2C1_TIMING_100KHZ == 0u) ||
            (khz == 400u && I2C1_TIMING_400KHZ == 0u)) {
            cli_printf("WARN: TIMING macro for %lu kHz is 0 -> using current timing (no real change).\r\n",
                       (unsigned long)khz);
        }
    } else {
        cli_printf("\r\nI2C re-init FEHLER (timing=0x%08lX)\r\n", (unsigned long)timing);
    }
}

static void i2c_setup_set_clock_choice(uint8_t choice)
{
    i2c_init_timings_if_needed();
    switch (choice) {
        case 1: i2c_reinit_with_timing(g_timing_10k,  10u);  break;
        case 2: i2c_reinit_with_timing(g_timing_100k, 100u); break;
        case 3: i2c_reinit_with_timing(g_timing_400k, 400u); break;
        default: break;
    }
}

// ---------------- i2cdetect style scan ----------------
static void I2C_PrintDetectTable(void)
{
    // Scan-Parameter (konservativ, analyzer-friendly)
    const uint32_t trials   = 1;
    const uint32_t timeout  = 10;  // ms
    const uint32_t delay_ms = 1;   // pause zwischen probes

    cli_printf("\r\n     ");
    for (uint8_t x = 0; x < 16u; x++) {
        cli_printf("%02x ", x);
    }
    cli_printf("\r\n");

    for (uint8_t row = 0; row < 8u; row++) {
        uint8_t base = (uint8_t)(row << 4);
        cli_printf("%02x: ", base);

        for (uint8_t col = 0; col < 16u; col++) {
            uint8_t addr = (uint8_t)(base + col);

            // wie i2cdetect: nur 0x03..0x77
            if (addr < 0x03u || addr > 0x77u) {
                cli_printf("   ");
                continue;
            }

            // Falls I2C in einem komischen Zustand hängt, einmal recovern
            if (HAL_I2C_GetState(&hi2c1) != HAL_I2C_STATE_READY) {
                (void)HAL_I2C_DeInit(&hi2c1);
                (void)HAL_I2C_Init(&hi2c1);
            }

            HAL_StatusTypeDef st = HAL_I2C_IsDeviceReady(
                    &hi2c1,
                    (uint16_t)(addr << 1),
                    trials,
                    timeout);

            // ErrorCode löschen, damit der nächste Probe sauber läuft
            hi2c1.ErrorCode = HAL_I2C_ERROR_NONE;

            if (st == HAL_OK) cli_printf("%02x ", addr);
            else              cli_printf("-- ");

            if (delay_ms) HAL_Delay(delay_ms);
        }

        cli_printf("\r\n");
    }

    cli_printf("\r\n");
}

// ---------------- Help ----------------
static void i2c_print_help(void)
{
    if (!CLI_IsDebugEnabled()) {
        CLI_PrintDebugRequired();
        return;
    }
    cli_printf("I2C Mode Befehle:\r\n");
    cli_printf("  v <mv>      - LDO1 Spannung setzen (500..3300mV) und enable\r\n");
    cli_printf("  s           - I2C scan (i2cdetect-style)\r\n");
    cli_printf("  dump <addr> - Dump 0x00..0xFF (Byteformat + ASCII)\r\n");
    cli_printf("  w..z..p     - Write Stream: w(ADDR7)(DATA..)(zDATA..)*p\r\n");
    cli_printf("  w..r..p     - Read Stream : w(ADDR7)(REG..)(rLEN|rb|rw|rh)p\r\n");
    cli_printf("               Beispiel: w3c57r01p (read 1 byte ab reg 0x57)\r\n");
    cli_printf("               ADDR7 muss 0x00..0x7F sein (z.B. w50AABBp)\r\n");
    cli_printf("  ?  	      - diese Hilfe\r\n");
}


// ---------------- Public API ----------------
void I2C_Mode_Enter(void)
{
    ws_reset();
    if (CLI_IsDebugEnabled()) {
        i2c_print_help();
    }
    i2c_print_help();
}

uint8_t I2C_Mode_HandleLine(char *line)
{
    // trim leading spaces
    while (*line == ' ' || *line == '\t') line++;
    if (*line == '\0') return 1;

    char *cmd = strtok(line, " \t");
    if (!cmd) return 1;

    // Setup menu auch als Line-Command: 's'
    if (strcmp(cmd, "s") == 0) {
        i2c_setup_show_main();
        return 1;
    }


    // Scan als Line-Command: 'scan'
    if (strcmp(cmd, "scan") == 0) {
        cli_printf("\r\nI2C scan (0x03..0x77):\r\n");
        I2C_PrintDetectTable();
        return 1;
    }
    if (strcmp(cmd, "dump") == 0) {
        char *addr_s = strtok(NULL, " \t");
        if (!addr_s) {
            cli_printf("Usage: dump <addr7>\r\n");
            return 1;
        }

        uint32_t addr = strtoul(addr_s, NULL, 0);
        if (addr > 0x7Fu) {
            cli_printf("dump: FEHLER (addr 0x00..0x7F)\r\n");
            return 1;
        }
        i2c_dump_device((uint8_t)addr);
        return 1;
    }
    if (strcmp(cmd, "v") == 0 || strcmp(cmd, "voltage") == 0)
    {
        cli_printf("Hinweis: v <mv> ist deprecated, nutze Setup (s).\r\n");
        char *mv_s = strtok(NULL, " \t");
        if (!mv_s) {
            cli_printf("Usage: v <mv>\r\n");
            return 1;
        }

