emme-tho/STM32H745/CM7/Core/Src/i2c_mode.c
        uint32_t mv = strtoul(mv_s, NULL, 0);
        setup_set_voltage(voltage_i2c,mv);
    }

    cli_printf("Unbekannt: %s (help)\r\n", cmd);
    return 1;
}

// ============================================================
// CHAR Handler fuer sofortige Eingabe (s, w..z..p)
// Rueckgabe: 1 = konsumiert, 0 = nicht meins
// ============================================================
uint8_t I2C_Mode_HandleChar(char ch)
{
    // Wenn gerade kein write läuft:
    if (!ws_active) {
        // Setup menu per Taste 's' (konsistent für alle Interfaces)
        if (ch == 's' || ch == 'S') {
            i2c_setup_show_main();
            return 1;
        }

        if (ch == '?') { i2c_print_help(); return 1; }

        // Wenn Setup aktiv ist: Auswahl verarbeiten
        if (g_setup_state != I2C_SETUP_NONE) {
            if (g_setup_state == I2C_SETUP_MAIN) {
                if (ch == '1') { i2c_setup_show_voltage(); return 1; }
                if (ch == '2') { i2c_setup_show_clock();   return 1; }
                if (ch == 'q' || ch == 'Q') {
                    g_setup_state = I2C_SETUP_NONE;
                    cli_printf("\r\n(I2C setup closed)\r\n");
                    CLI_PrintPrompt();
                    return 1;
                }
                return 1;
            }

            if (g_setup_state == I2C_SETUP_VOLTAGE) {
                if (ch == '1') { setup_set_voltage(voltage_i2c,800u);  i2c_setup_show_voltage(); return 1; }
                if (ch == '2') { setup_set_voltage(voltage_i2c,1800u); i2c_setup_show_voltage(); return 1; }
                if (ch == '3') { setup_set_voltage(voltage_i2c,3300); i2c_setup_show_voltage(); return 1; }
                if (ch == 'q' || ch == 'Q') { i2c_setup_show_main(); return 1; }
                return 1;
            }

            if (g_setup_state == I2C_SETUP_CLOCK) {
                if (ch == '1') { i2c_setup_set_clock_choice(1); i2c_setup_show_clock(); return 1; }
                if (ch == '2') { i2c_setup_set_clock_choice(2); i2c_setup_show_clock(); return 1; }
                if (ch == '3') { i2c_setup_set_clock_choice(3); i2c_setup_show_clock(); return 1; }
                if (ch == 'q' || ch == 'Q') { i2c_setup_show_main(); return 1; }
                return 1;
            }

            return 1;
        }


        // Scan per Taste 'c'
        if (ch == 'c' || ch == 'C') {
            cli_printf("\r\nI2C scan (0x03..0x77):\r\n");
            I2C_PrintDetectTable();
            return 1;
        }

        // Start write stream
         if (ch == 'w' || ch == 'W') {
        	 ws_active  = 1;
        	 ws_nib_len = 0;
        	 ws_tx_len  = 0;
        	 ws_seg_idx = 0;
        	 ws_have_addr = 0;
        	 ws_addr7 = 0;

        	 rs_active = 0;
             rs_nib_len = 0;
             rs_len_set = 0;
             rs_len = 0;
             memset(rs_nibbles, 0, sizeof(rs_nibbles));

             cli_printf("\r\nwrite: ");
             return 1;
         }
         return 0;
    }

    // write active: x soll global wirken -> abbrechen, NICHT konsumieren
    if (ch == 'x' || ch == 'X') {
        ws_reset();
        cli_printf("\r\n(write aborted)\r\n");
        return 0;
    }


    // ------------------------------------------------------------
    // READ-MODE (nach 'r'): hier sammeln wir nur noch LEN / Format
    // ------------------------------------------------------------
    if (rs_active) {
        // Shortcuts: rb/rw/rh (nur wenn noch keine Hex-Ziffern gesammelt wurden)
        if (!rs_len_set && rs_nib_len == 0) {
            if (ch == 'b' || ch == 'B') {
                rs_len = 1;
                rs_len_set = 1;
                (void)CDC_Transmit_HS((uint8_t*)&ch, 1);
                return 1;
            }
            if (ch == 'w' || ch == 'W') {
                rs_len = 2;
                rs_len_set = 1;
                (void)CDC_Transmit_HS((uint8_t*)&ch, 1);
                return 1;
            }
            if (ch == 'h' || ch == 'H') {
                rs_len = 4;
                rs_len_set = 1;
                (void)CDC_Transmit_HS((uint8_t*)&ch, 1);
                return 1;
            }
        }

        // LEN als Hex (1..4 Nibbles)
        if (hex_nibble(ch) >= 0) {
            if (rs_nib_len < (uint8_t)sizeof(rs_nibbles)) {
                rs_nibbles[rs_nib_len++] = ch;
                (void)CDC_Transmit_HS((uint8_t*)&ch, 1);
            }
            return 1;
        }

        // 'p' wird unten finalisiert
        // alles andere ignorieren
    }

    // ------------------------------------------------------------
    // 'r' startet Read: wir finalisieren bis dahin die aktuellen Nibbles
    // ------------------------------------------------------------
    if (!rs_active && (ch == 'r' || ch == 'R')) {
        uint16_t new_start = 0, new_len = 0;
        HAL_StatusTypeDef fst = ws_finalize_segment_and_append(&new_start, &new_len);
        (void)new_start; (void)new_len;

        if (fst != HAL_OK) {
            cli_printf("\r\nwrite: FEHLER (addr>0x7F oder hex/len)\r\n");
            ws_reset();
            return 1;
        }

        if (!ws_have_addr) {
            cli_printf("\r\nread: FEHLER (addr missing)\r\n");
            ws_reset();
            return 1;
        }

        rs_active = 1;
        rs_nib_len = 0;
        rs_len_set = 0;
        rs_len = 0;
        memset(rs_nibbles, 0, sizeof(rs_nibbles));

        (void)CDC_Transmit_HS((uint8_t*)&ch, 1); // echo 'r'
        return 1;
    }

    // hex nibble
    if (hex_nibble(ch) >= 0) {
        if (ws_nib_len < (uint16_t)(sizeof(ws_nibbles) - 1u)) {
            ws_nibbles[ws_nib_len++] = ch;
            (void)CDC_Transmit_HS((uint8_t*)&ch, 1); // echo raw
        }
        return 1;
    }

    // ------------------------------------------------------------
    // Normaler Hex-Daten-Stream (nur wenn NICHT im read-mode)
    // ------------------------------------------------------------
    if (!rs_active && (hex_nibble(ch) >= 0)) {
        if (ws_nib_len < (uint16_t)(sizeof(ws_nibbles) - 1u)) {
            ws_nibbles[ws_nib_len++] = ch;
            (void)CDC_Transmit_HS((uint8_t*)&ch, 1); // echo raw
        }
        return 1;
    }

    // z = Segment Ende (no-stop marker)  (nur wenn NICHT im read-mode)
    if (!rs_active && (ch == 'z' || ch == 'Z')) {
        uint16_t new_start = 0, new_len = 0;
        HAL_StatusTypeDef fst = ws_finalize_segment_and_append(&new_start, &new_len);
        if (fst != HAL_OK) {
            if (!ws_have_addr) {
                cli_printf("\r\nwrite: FEHLER (addr>0x7F oder hex)\r\n");
            } else {
                cli_printf("\r\nwrite: FEHLER (hex/len)\r\n");
            }
            ws_reset();
            return 1;
        }

        if (!ws_have_addr) {
            cli_printf("\r\nwrite(seg%lu, no-stop): (addr missing)\r\nwrite: ",
                       (unsigned long)ws_seg_idx);
        } else {
            cli_printf("\r\nwrite(seg%lu, no-stop): addr7=0x%02X (bus=0x%02X) data=",
                       (unsigned long)ws_seg_idx, ws_addr7, (uint8_t)(ws_addr7 << 1));
            print_bytes(&ws_tx[new_start], new_len);
            cli_printf("\r\nwrite: ");
        }

