emme-tho/STM32H745/CM7/Core/Src/i2c_mode.c
        ws_seg_idx++;
        return 1;
    }


    // ------------------------------------------------------------
    // p = final (stop + send)  oder final read
    // ------------------------------------------------------------
    if (ch == 'p' || ch == 'P') {
        if (rs_active) {
            // READ finalisieren
            uint16_t len = 0;
            if (rs_parse_len(&len) != HAL_OK) {
                cli_printf("\r\nread: FEHLER (len missing/hex)\r\n");
                ws_reset();
                return 1;
            }
            if (len == 0 || len > sizeof(ws_rx)) {
                cli_printf("\r\nread: FEHLER (len 1..%u)\r\n", (unsigned)sizeof(ws_rx));
                ws_reset();
                return 1;
            }

            cli_printf("\r\nread(final): addr7=0x%02X (bus=0x%02X) prewrite=",
                       ws_addr7, (uint8_t)(ws_addr7 << 1));
            print_bytes(ws_tx, ws_tx_len);
            cli_printf("  len=%u\r\n", (unsigned)len);

            HAL_StatusTypeDef st = HAL_ERROR;

            if (ws_tx_len == 0) {
                // Direktes Lesen ohne Register-Pointer
                st = HAL_I2C_Master_Receive(
                        &hi2c1,
                        (uint16_t)(ws_addr7 << 1),
                        ws_rx,
                        (uint16_t)len,
                        I2C_TX_TIMEOUT_MS
                );
            } else if (ws_tx_len == 1) {
                uint16_t mem = ws_tx[0];
                st = HAL_I2C_Mem_Read(
                        &hi2c1,
                        (uint16_t)(ws_addr7 << 1),
                        mem,
                        I2C_MEMADD_SIZE_8BIT,
                        ws_rx,
                        (uint16_t)len,
                        I2C_TX_TIMEOUT_MS
                );
            } else if (ws_tx_len == 2) {
                uint16_t mem = (uint16_t)((ws_tx[0] << 8) | ws_tx[1]);
                st = HAL_I2C_Mem_Read(
                        &hi2c1,
                        (uint16_t)(ws_addr7 << 1),
                        mem,
                        I2C_MEMADD_SIZE_16BIT,
                        ws_rx,
                        (uint16_t)len,
                        I2C_TX_TIMEOUT_MS
                );
            } else {
                cli_printf("read: FEHLER (prewrite len=%u nicht unterstuetzt, nur 0/1/2)\r\n",
                           (unsigned)ws_tx_len);
                ws_reset();
                return 1;
            }

            uint32_t err   = HAL_I2C_GetError(&hi2c1);
            uint32_t state = HAL_I2C_GetState(&hi2c1);

            if (st == HAL_OK) {
                cli_printf("I2C RX OK: ");
                print_bytes(ws_rx, (uint16_t)len);
                cli_printf("\r\n");
            } else {
                cli_printf("I2C RX FEHLER: st=%lu, err=0x%08lX, state=%lu\r\n",
                           (unsigned long)st,
                           (unsigned long)err,
                           (unsigned long)state);
            }

            // ErrorCode löschen, damit der nächste Versuch sauber ist
            hi2c1.ErrorCode = HAL_I2C_ERROR_NONE;

            ws_reset();
            return 1;
        }

        // WRITE finalisieren
        uint16_t new_start = 0, new_len = 0;
        (void)new_start;
        (void)new_len;

        HAL_StatusTypeDef fst = ws_finalize_segment_and_append(&new_start, &new_len);
        if (fst != HAL_OK) {
            cli_printf("\r\nwrite: FEHLER (addr>0x7F oder hex/len)\r\n");
            ws_reset();
            return 1;
        }

        if (!ws_have_addr) {
            cli_printf("\r\nwrite: FEHLER (addr missing)\r\n");
            ws_reset();
            return 1;
        }

        cli_printf("\r\nwrite(final, stop): addr7=0x%02X (bus=0x%02X) data=",
                   ws_addr7, (uint8_t)(ws_addr7 << 1));
        print_bytes(ws_tx, ws_tx_len);
        cli_printf("\r\n");

        HAL_StatusTypeDef st = HAL_I2C_Master_Transmit(
                &hi2c1,
                (uint16_t)(ws_addr7 << 1),
                ws_tx,
                ws_tx_len,
                I2C_TX_TIMEOUT_MS
        );

        uint32_t err   = HAL_I2C_GetError(&hi2c1);
        uint32_t state = HAL_I2C_GetState(&hi2c1);

        if (st == HAL_OK) {
            cli_printf("I2C TX OK\r\n");
        } else {
            cli_printf("I2C TX FEHLER: st=%lu, err=0x%08lX, state=%lu\r\n",
                       (unsigned long)st,
                       (unsigned long)err,
                       (unsigned long)state);
        }

        // ErrorCode löschen, damit der nächste Versuch sauber ist
        hi2c1.ErrorCode = HAL_I2C_ERROR_NONE;

        ws_reset();
        return 1;
    }

    // alles andere im write-mode ignorieren
    return 1;
}
